fonecmid-diplom/src/Documents/BKM_ОбслуживаниеКлиентов/BKM_ОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>BKM_ОбслуживаниеКлиентов</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_Специалисты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/BKM_ОбслуживаниеКлиентов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	  
#Область ОбработчикиСобытий   
Процедура ОбработкаПроведения(Отказ, Режим)
		  
		  ПроверитьДанныеДоговора(Отказ);
		  
		  Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
		  ВсегоЧасовКОплатеКлиенту = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
		  СтавкаЧасаПоДоговору = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,"ВКМ_СтоимостьЧаса");
		  СуммаКОплатеКлиенту = ВсегоЧасовКОплатеКлиенту * СтавкаЧасаПоДоговору;
		  
		  Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		  Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		  Движение.Период = Дата;
		  Движение.КоличествоЧасов = ВсегоЧасовКОплатеКлиенту;
		  Движение.СуммаКОплате = СуммаКОплатеКлиенту;
		  Движение.Клиент = Клиент;
		  Движение.Договор = Договор;
		  
КонецПроцедуры    

Процедура ПроверитьДанныеДоговора(Отказ)
	
	Если ВыполненныеРаботы.Количество() = 0 Тогда
		ТекстСообщения = "Для проведения документа заполните табличную часть документа";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;  
		Возврат;
	КонецЕсли;   
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВидДоговора, ВКМ_ДатаНачала, ВКМ_ДатаОкончания");
	
	Если РеквизитыДоговора.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда 
		ТекстСообщения = "Для проведения документа должен быть выбран договор с типом ""Абонентская плата""";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Ссылка,"Договор","Объект");
		Отказ = Истина; 
		Возврат;
	Иначе
		Если РеквизитыДоговора.ВКМ_ДатаНачала > Дата Или РеквизитыДоговора.ВКМ_ДатаОкончания < Дата Тогда
			ТекстСообщения = "Дата документа должна находиться в периоде действия договора: " 
                      + РеквизитыДоговора.BKM_ДатаНачала + " - " + РеквизитыДоговора.BKM_ДатаОкончания;
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Ссылка,"Договор","Объект");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
  
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		СообщениеТелеграмБоту = ПолучитьТекстСообщения();  
		Если ЗначениеЗаполнено(СообщениеТелеграмБоту) Тогда
			НовоеУведомление = Справочники.ВКМ_УведомлениеТелеграм.СоздатьЭлемент();   
			НовоеУведомление.Наименование = Ссылка;
			НовоеУведомление.ТекстСообщения = СообщениеТелеграмБоту; 
			НовоеУведомление.Записать();
		КонецЕсли;
КонецПроцедуры
	  
#КонецОбласти 


#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекстСообщения()
	
	ТекстСообщения = "";
	
	Если ЭтоНовый() Тогда
		ТекстСообщения = "Поступила новая заявка на сервисное обслуживание";
	Иначе
		СтарыеЗначения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,"ДатаПроведенияРабот, ВремяНачалаПлан, ВремяОкончанияПлан, Специалист");
		
		ТекущиеЗначения = Новый Структура;
		ТекущиеЗначения.Вставить("ДатаПроведенияРабот", ДатаПроведенияРабот);
		ТекущиеЗначения.Вставить("ВремяНачалаПлан", ВремяНачалаПлан);
		ТекущиеЗначения.Вставить("ВремяОкончанияПлан", ВремяОкончанияПлан);
		ТекущиеЗначения.Вставить("Специалист", Специалист);
		
		Если Не ОбщегоНазначения.ДанныеСовпадают(СтарыеЗначения, ТекущиеЗначения) Тогда
			ТекстСообщения = "Произошли изменения в заявке на обслуживание клиента";
		КонецЕсли;
	КонецЕсли;
	
	Если ТекстСообщения <> "" Тогда
		ТекстСообщения = СтрШаблон("%1
						|Номер заявки: №%2
						|Дата формирования: %3
						|Клиент: %4
						|Плановые сроки выполнения:
						|  - Дата: %5
						|  - Время: с %6 до %7
						|Ответственный специалист: %8",
						ТекстСообщения,
						Ссылка.Номер,
						Формат(Дата, "ДФ=dd.MM.yyyy"),
						Клиент,
						Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy"),
						Формат(ВремяНачалаПлан, "ДФ=ЧЧ:мм"),
						Формат(ВремяОкончанияПлан, "ДФ=ЧЧ:мм"),
						Специалист);		
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции
//	
//КонецФункции


#КонецОбласти  

#КонецЕсли
